# ──────────────────────────────────────────────────────────────────────────────
# Brewfile — all packages in one place
# Install: brew bundle --file=Brewfile
# ──────────────────────────────────────────────────────────────────────────────

# CLI tools
brew "zsh"
brew "podman"
brew "podman-compose"
brew "starship"
brew "fnm"
brew "tailscale"
brew "wget"
brew "gh"
brew "git-lfs"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "opencode"
brew "copilot"

# GUI apps
brew "desktoppr" if OS.mac?
cask "ghostty" if OS.mac?
cask "github" if OS.mac?
cask "1password" if OS.mac?
cask "1password-cli" if OS.mac?
cask "vscodium" if OS.mac?
cask "zed" if OS.mac?
cask "podman-desktop" if OS.mac?
cask "devpod" if OS.mac?
cask "font-fira-code-nerd-font" if OS.mac?
cask "obsidian" if OS.mac?

# Mac App Store apps (uncomment and add IDs as needed)
# mas "Xcode", id: 497799835
