# ──────────────────────────────────────────────────────────────────────────────
# Brewfile — all packages in one place
# Install: brew bundle --file=Brewfile
# ──────────────────────────────────────────────────────────────────────────────

# CLI tools
brew "zsh"
brew "podman"
brew "podman-compose"
brew "starship"
brew "fnm"
brew "wget"
brew "gh"
brew "git-lfs"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "opencode"
brew "copilot"

# GUI apps
cask "desktoppr" if OS.mac?
cask "ghostty" if OS.mac?
cask "github" if OS.mac?
cask "1password" if OS.mac?
cask "1password-cli" if OS.mac?
cask "vscodium" if OS.mac?
cask "zed" if OS.mac?
cask "podman-desktop" if OS.mac?
cask "devpod" if OS.mac?
cask "font-fira-code-nerd-font" if OS.mac?
cask "obsidian" if OS.mac?
cask "tailscale-app" if OS.mac?
cask "ungoogled-chromium" if OS.mac?
cask "firefox@developer-edition" if OS.mac?
cask "utm" if OS.mac?

# Mac App Store apps
mas "1Password for Safari", id: 1569813296
mas "uBlock Origin Lite", id: 6745342698
mas "Consent-O-Matic", id: 1606897889
